---
type: ThermalAsset
namespace: Autodesk.Revit.DB
version: 2024
members: 23
tags: [revit-api, class]
---

# ThermalAsset

`Autodesk.Revit.DB.ThermalAsset` · Revit 2024 · 23 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ThermalAsset | 2013 | `public ThermalAsset ( string name , ThermalMaterialType materialType )` |
| Method | Copy | 2013 | `public ThermalAsset Copy ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Equals | — | `` |
| Method | EqualsThermalOnly | 2013 | `public bool EqualsThermalOnly ( ThermalAsset other )` |
| Property | Behavior | 2013 | `public StructuralBehavior Behavior { get ; set ; }` |
| Property | Compressibility | 2013 | `public double Compressibility { get ; set ; }` |
| Property | Density | 2013 | `public double Density { get ; set ; }` |
| Property | ElectricalResistivity | 2013 | `public double ElectricalResistivity { get ; set ; }` |
| Property | Emissivity | 2013 | `public double Emissivity { get ; set ; }` |
| Property | GasViscosity | 2013 | `public double GasViscosity { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LiquidViscosity | 2013 | `public double LiquidViscosity { get ; set ; }` |
| Property | Name | 2013 | `public string Name { get ; set ; }` |
| Property | Permeability | 2013 | `public double Permeability { get ; set ; }` |
| Property | Porosity | 2013 | `public double Porosity { get ; set ; }` |
| Property | Reflectivity | 2013 | `public double Reflectivity { get ; set ; }` |
| Property | SpecificHeat | 2014 | `public double SpecificHeat { get ; set ; }` |
| Property | SpecificHeatOfVaporization | 2013 | `public double SpecificHeatOfVaporization { get ; set ; }` |
| Property | ThermalConductivity | 2013 | `public double ThermalConductivity { get ; set ; }` |
| Property | ThermalMaterialType | 2013 | `public ThermalMaterialType ThermalMaterialType { get ; }` |
| Property | TransmitsLight | 2013 | `public bool TransmitsLight { get ; set ; }` |
| Property | VaporPressure | 2013 | `public double VaporPressure { get ; set ; }` |